lferrazzini95/tiny-notes/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# reTerminal Sticky hardware: ESP32-S3R8 with 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# reTerminal Sticky hardware: 256 Mbit / 32 MB external QSPI flash.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OTA-ready custom flash layout.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Auto-sleep demo defaults for hardware validation.
CONFIG_FOLLOWUP_AUTO_SLEEP_DISPLAY_SLEEP_TIMEOUT_SECONDS=180
CONFIG_FOLLOWUP_AUTO_SLEEP_LIGHT_SLEEP_TIMEOUT_SECONDS=1800

# Wi-Fi and clock-sync demo defaults. Runtime NVS settings take precedence over
# these built-in station credentials.
CONFIG_FOLLOWUP_WIFI_AP_PREFIX="Followup"
CONFIG_FOLLOWUP_WIFI_STA_SSID=""
CONFIG_FOLLOWUP_WIFI_STA_PASSWORD=""
CONFIG_FOLLOWUP_WIFI_START_IN_AP_MODE=n
CONFIG_FOLLOWUP_TIME_SYNC_DEFAULT_ENABLED=y
CONFIG_FOLLOWUP_DEFAULT_TIMEZONE_NAME="North_America_Eastern"
CONFIG_FOLLOWUP_GEMINI_API_KEY=""

# SD format demo defaults.
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LFN_STACK=n
CONFIG_FATFS_USE_LABEL=y
